src/SimplyTestable/ApiBundle/Tests/Fixtures/Data/StripeEvent/invoice.payment_failed.no_lines.json

{
  "id": "evt_2nM539jUZHWMN1",
  "created": 1382372280,
  "livemode": true,
  "type": "invoice.payment_failed",
  "data": {
    "object": {
      "date": 1382368620,
      "id": "in_2nL671LyaO5mbg",
      "period_start": 1379776581,
      "period_end": 1382368580,
      "lines": {
        "object": "list",
        "count": 1,
        "url": "/v1/invoices/in_2nL671LyaO5mbg/lines",
        "data": []
      },
      "subtotal": 1900,
      "total": 1900,
      "customer": "{{stripe_customer}}",
      "object": "invoice",
      "attempted": true,
      "closed": true,
      "paid": false,
      "livemode": true,
      "attempt_count": 1,
      "amount_due": 1900,
      "currency": "gbp",
      "starting_balance": 0,
      "ending_balance": 0,
      "next_payment_attempt": null,
      "charge": null,
      "discount": null,
      "application_fee": null
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": null
}